{
  "dialogs": [
    {
      "speaker": 1,
      "start": 0.0,
      "end": 21.86,
      "text": " Hey, what′s up everyone, this is Sam. In today′s interview, part of our guest host series, you′ll hear a conversation led by longtime friend of the show, John Bohannon, Director of Science at Primer AI and former journalist for publications like Science Magazine, Wired, and others. I′m sure you′re going to enjoy this conversation, so let′s jump in. Peace."
    },
    {
      "speaker": 2,
      "start": 31.8,
      "end": 34.42,
      "text": " Good morning, Marti. Good morning, John."
    },
    {
      "speaker": 2,
      "start": 34.86,
      "end": 40.0,
      "text": " So we are just a few miles away from each other across a body of water. I′m in San"
    },
    {
      "speaker": 2,
      "start": 40.0,
      "end": 45.14,
      "text": " Francisco. You′re across the bay in Berkeley at your office at University of California,"
    },
    {
      "speaker": 2,
      "start": 45.22,
      "end": 50.62,
      "text": " Berkeley, where you are the head of the School of Information and a computer scientist who′s"
    },
    {
      "speaker": 2,
      "start": 50.62,
      "end": 52.72,
      "text": " been in the game for many decades. That′s right."
    },
    {
      "speaker": 2,
      "start": 52.94,
      "end": 57.16,
      "text": " So I′m excited to finally do this interview because it′s been almost a year in the making."
    },
    {
      "speaker": 2,
      "start": 57.64,
      "end": 63.36,
      "text": " We had a great interview here on the show with Orin Etzioni, former head of AI2 in"
    },
    {
      "speaker": 2,
      "start": 63.36,
      "end": 67.76,
      "text": " Seattle. After that interview, I asked Orin who would be a really good guest who would"
    },
    {
      "speaker": 2,
      "start": 67.76,
      "end": 71.92,
      "text": " have something worth sharing with the audience, and you were the first person he said."
    },
    {
      "speaker": 0,
      "start": 72.3,
      "end": 76.58,
      "text": " Well, I listened to that interview, and it was an excellent interview. Orin is so articulate,"
    },
    {
      "speaker": 0,
      "start": 76.78,
      "end": 81.56,
      "text": " and you′re a great interviewer. I′m really honored to be here, and I′m really honored"
    },
    {
      "speaker": 0,
      "start": 81.56,
      "end": 84.46,
      "text": " that Orin thought it was worthwhile to recommend me."
    },
    {
      "speaker": 2,
      "start": 84.72,
      "end": 87.24,
      "text": " You don′t do that many interviews, from what I gather."
    },
    {
      "speaker": 0,
      "start": 88.0,
      "end": 93.74,
      "text": " No, I don′t. I′m a little bit camera shy, even though I do have to be on camera a lot."
    },
    {
      "speaker": 0,
      "start": 93.94,
      "end": 99.44,
      "text": " Also, I like to be pretty careful about what I say, kind of more from the scientist′s"
    },
    {
      "speaker": 0,
      "start": 99.44,
      "end": 105.76,
      "text": " perspective. I think Orin is really great at linking science to business and where technology"
    },
    {
      "speaker": 0,
      "start": 105.76,
      "end": 108.94,
      "text": " is going. But yeah, I guess I′m just a little bit shy that way."
    },
    {
      "speaker": 2,
      "start": 109.26,
      "end": 114.08,
      "text": " And that brings me to kind of the big story here. For those listening at home, Marty and I had a"
    },
    {
      "speaker": 2,
      "start": 114.32,
      "end": 118.58,
      "text": " chat recently in advance of this interview just to talk about what we might talk about."
    },
    {
      "speaker": 2,
      "start": 119.24,
      "end": 124.96,
      "text": " And something really striking was that there′s this moment, let′s call it the chat GPT moment,"
    },
    {
      "speaker": 2,
      "start": 125.26,
      "end": 130.4,
      "text": " it′s really the large language model moment, where artificial intelligence seems to be at"
    },
    {
      "speaker": 2,
      "start": 130.4,
      "end": 136.92,
      "text": " some kind of inflection point. And you told me about your long career and how you have kind of"
    },
    {
      "speaker": 2,
      "start": 136.92,
      "end": 141.68,
      "text": " seen these moments before, and you′re more cautious about speaking publicly to add to the"
    },
    {
      "speaker": 2,
      "start": 141.68,
      "end": 147.4,
      "text": " hype cycle because it′s often disappointing and often regrettable. It′s easy to say things that"
    },
    {
      "speaker": 2,
      "start": 147.4,
      "end": 152.28,
      "text": " you later think were overhyped. Why is this different? Yeah, so I have seen a lot over the"
    },
    {
      "speaker": 0,
      "start": 152.28,
      "end": 158.34,
      "text": " years. I′ve been, I′d say, primarily in natural language processing, that part of AI. And it′s"
    },
    {
      "speaker": 0,
      "start": 158.34,
      "end": 164.38,
      "text": " just been a slog in terms of making progress and having machines be able to process language the"
    },
    {
      "speaker": 0,
      "start": 164.38,
      "end": 168.52,
      "text": " way people do. I entered it really because I was interested in the brain and interested in language"
    },
    {
      "speaker": 0,
      "start": 168.6,
      "end": 173.56,
      "text": " and I thought it would be kind of neat if we could have a computer do something with language, maybe"
    },
    {
      "speaker": 0,
      "start": 173.56,
      "end": 179.24,
      "text": " make cartoons speak, something like that. Animation interested me as well. We′re so far"
    },
    {
      "speaker": 0,
      "start": 179.24,
      "end": 185.04,
      "text": " from accomplishing anything that would be realistic that was more of a scientific endeavor."
    },
    {
      "speaker": 0,
      "start": 185.24,
      "end": 189.16,
      "text": " I think I′m more of a scientist at heart than, you know, I′m not an entrepreneur, for example."
    },
    {
      "speaker": 0,
      "start": 189.56,
      "end": 197.96,
      "text": " So I′ve seen claims, for example, I remember, I guess in the early 90s, there was this claim that"
    },
    {
      "speaker": 0,
      "start": 197.96,
      "end": 204.0,
      "text": " it was going to transform everything. And it was just so obviously ludicrous. But you also see,"
    },
    {
      "speaker": 0,
      "start": 204.1,
      "end": 208.68,
      "text": " you know, I remember when WebFountain came out with IBM and that was going to transform everything."
    },
    {
      "speaker": 0,
      "start": 209.16,
      "end": 213.58,
      "text": " And, you know, it′s very much... Or how about IBM Watson? Well, you know, Watson was a special case"
    },
    {
      "speaker": 0,
      "start": 213.58,
      "end": 219.08,
      "text": " in that it was amazing what they did with Jeopardy and we can talk about that a bit more. But then"
    },
    {
      "speaker": 0,
      "start": 219.08,
      "end": 224.32,
      "text": " there was the claim that it was going to transform healthcare. And again, there was no path from that"
    },
    {
      "speaker": 2,
      "start": 224.32,
      "end": 229.78,
      "text": " to directly to healthcare being transformed in the immediate future. So I learned that if you"
    },
    {
      "speaker": 2,
      "start": 229.78,
      "end": 234.6,
      "text": " read the New York Times regularly, as I do, technology is in the business section as opposed"
    },
    {
      "speaker": 2,
      "start": 234.6,
      "end": 240.6,
      "text": " to the science section. And that′s kind of how technology is talked about in, at least in the US."
    },
    {
      "speaker": 2,
      "start": 240.98,
      "end": 245.52,
      "text": " And of course, there is scientific reporting on it. And your podcast, I think, is wonderful in that"
    },
    {
      "speaker": 2,
      "start": 245.52,
      "end": 249.84,
      "text": " it goes into a lot of technical details, which is really exciting. But there′s always the business"
    },
    {
      "speaker": 2,
      "start": 249.84,
      "end": 254.96,
      "text": " angle when it comes to technology, even when I started out in the late 80s and, you know,"
    },
    {
      "speaker": 2,
      "start": 255.2,
      "end": 261.18,
      "text": " at most there were PCs. Well, in the late 80s and into the 90s, you became one of the main"
    },
    {
      "speaker": 2,
      "start": 261.18,
      "end": 266.6,
      "text": " researchers in search. And search really defined the era that I think is probably coming to a"
    },
    {
      "speaker": 2,
      "start": 266.6,
      "end": 273.6,
      "text": " close, the Google era, the era of search, search driving everything. And so you did really see the"
    },
    {
      "speaker": 2,
      "start": 273.6,
      "end": 278.7,
      "text": " business side of your research explode and change the world. Are we in a moment like that now?"
    },
    {
      "speaker": 0,
      "start": 278.84,
      "end": 283.7,
      "text": " Well, I wouldn′t mind talking about search for a few minutes since it is close to my heart. I mean,"
    },
    {
      "speaker": 0,
      "start": 283.78,
      "end": 287.7,
      "text": " I was interested in search because I wanted to be able to find things. I didn′t like the library"
    },
    {
      "speaker": 0,
      "start": 287.7,
      "end": 292.68,
      "text": " catalog when I was a little kid. And in fact, when I was an intern, I tried to be an intern in my"
    },
    {
      "speaker": 0,
      "start": 292.68,
      "end": 297.22,
      "text": " public library in high school and I was rejected because I wasn′t fast enough with filing"
    },
    {
      "speaker": 0,
      "start": 297.22,
      "end": 301.3,
      "text": " alphabetically in the card catalog. But I never thought that makes sense. So actually, I always"
    },
    {
      "speaker": 0,
      "start": 301.3,
      "end": 306.72,
      "text": " wanted to do a dynamic, smart version of the card catalog, which is what I did in search user"
    },
    {
      "speaker": 0,
      "start": 306.74,
      "end": 312.06,
      "text": " interfaces. There′s only one spot in the bookshelf for the book representation. What I focused on"
    },
    {
      "speaker": 0,
      "start": 312.06,
      "end": 316.58,
      "text": " was search user interfaces. I wouldn′t say I was the leading person in search, but I was a leader"
    },
    {
      "speaker": 0,
      "start": 316.58,
      "end": 321.52,
      "text": " in search user interfaces, which was kind of a hybrid topic at the time because most of the"
    },
    {
      "speaker": 0,
      "start": 321.52,
      "end": 325.96,
      "text": " search field was more on algorithms and not so much on the user interface. So I brought those"
    },
    {
      "speaker": 0,
      "start": 325.96,
      "end": 333.96,
      "text": " two together. And that was super exciting because the technology or the kind of framework that I"
    },
    {
      "speaker": 0,
      "start": 334.18,
      "end": 339.06,
      "text": " worked with, did become the standard for it′s still a standard faceted interaction, what you"
    },
    {
      "speaker": 0,
      "start": 339.06,
      "end": 344.94,
      "text": " see on a website when you′re shopping or library catalogs where you can slice and dice and filter"
    },
    {
      "speaker": 0,
      "start": 344.94,
      "end": 350.7,
      "text": " in different ways to find the items that you want. Getting that interface to work well was a big"
    },
    {
      "speaker": 0,
      "start": 350.7,
      "end": 354.56,
      "text": " challenge and that was sort of the breakthrough. What was the big problem with search interfaces"
    },
    {
      "speaker": 0,
      "start": 354.56,
      "end": 360.6,
      "text": " before you got into the game? Well, when I got into the game, most software did not have search"
    },
    {
      "speaker": 0,
      "start": 360.96,
      "end": 365.88,
      "text": " full stop. I mean, if you had an application, you couldn′t search for material within it."
    },
    {
      "speaker": 0,
      "start": 366.12,
      "end": 371.22,
      "text": " It was just rare. It just didn′t happen much. When I got into the game, library catalogs were"
    },
    {
      "speaker": 0,
      "start": 371.22,
      "end": 377.3,
      "text": " searched by saying, you know, PN Bonneman comma J to find the personal name of the author. I mean,"
    },
    {
      "speaker": 0,
      "start": 377.32,
      "end": 383.84,
      "text": " it was command lined. And then there were Westlaw and these very expensive tools that you could"
    },
    {
      "speaker": 0,
      "start": 383.84,
      "end": 389.14,
      "text": " subscribe to, say if you were a lawyer, it was all keyword based. But the interface, there was no"
    },
    {
      "speaker": 0,
      "start": 389.14,
      "end": 393.6,
      "text": " thought to the interface. It was just a listing of the output that you got, usually in chronological"
    },
    {
      "speaker": 0,
      "start": 393.6,
      "end": 398.52,
      "text": " order. And so there was just no there there. The web changed things, but even with the web,"
    },
    {
      "speaker": 0,
      "start": 398.58,
      "end": 402.68,
      "text": " the initial search was, you know, the 10 blue links, which has actually been really hard to"
    },
    {
      "speaker": 0,
      "start": 402.68,
      "end": 407.62,
      "text": " improve on. And I would say until now, which we could get to the new moment, you know,"
    },
    {
      "speaker": 0,
      "start": 407.62,
      "end": 411.68,
      "text": " Google′s inched towards showing answers to questions. But I remember talking with someone"
    },
    {
      "speaker": 0,
      "start": 411.68,
      "end": 414.68,
      "text": " there saying that they were conservative initially because they didn′t want to show incorrect"
    },
    {
      "speaker": 2,
      "start": 414.68,
      "end": 418.6,
      "text": " information. And I thought that was the right way to go. Isn′t that one of the big shifts?"
    },
    {
      "speaker": 2,
      "start": 418.64,
      "end": 424.78,
      "text": " It′s like once upon a time, the purpose of search was to find a document or find a resource. But"
    },
    {
      "speaker": 2,
      "start": 424.78,
      "end": 430.26,
      "text": " nowadays you want the answer to a question. It′s almost a shift in intention. Actually, I speak to"
    },
    {
      "speaker": 0,
      "start": 430.26,
      "end": 436.04,
      "text": " that. I think people always wanted to ask questions, but it wasn′t possible to get an answer. So we"
    },
    {
      "speaker": 0,
      "start": 436.04,
      "end": 441.0,
      "text": " were just adapting to a bad system. Well, I always like to use the example of this old website called"
    },
    {
      "speaker": 0,
      "start": 441.0,
      "end": 446.08,
      "text": " Ask Jeeves, which was an attempt to allow people to ask questions and get answers. And it didn′t"
    },
    {
      "speaker": 0,
      "start": 446.08,
      "end": 450.48,
      "text": " work because the technology didn′t work, but people kept using it and always said they liked"
    },
    {
      "speaker": 0,
      "start": 450.48,
      "end": 456.0,
      "text": " it because they liked the idea of being able to ask a question and get an answer. And I have some"
    },
    {
      "speaker": 0,
      "start": 456.0,
      "end": 461.72,
      "text": " old screenshots of it. It just didn′t work. It′s like someone saying, oh, people like the mouse,"
    },
    {
      "speaker": 0,
      "start": 461.84,
      "end": 466.18,
      "text": " but now we have touchscreens and their tastes have changed. I′m like, no, no. It′s that we didn′t"
    },
    {
      "speaker": 0,
      "start": 466.18,
      "end": 470.74,
      "text": " know how to do touchscreens. We didn′t know how to do gestures. Technologically, in the early days,"
    },
    {
      "speaker": 0,
      "start": 470.74,
      "end": 477.52,
      "text": " it was a bridge to that. So often the interface we see now is the interface people always wanted,"
    },
    {
      "speaker": 0,
      "start": 477.68,
      "end": 481.6,
      "text": " but we didn′t have the technology to support it. And I′d say that′s true for question answering."
    },
    {
      "speaker": 0,
      "start": 481.96,
      "end": 487.24,
      "text": " Now, there′s an exception for scholars and people doing research who want to see the documents and"
    },
    {
      "speaker": 0,
      "start": 487.24,
      "end": 492.08,
      "text": " primary resources, but that′s always been a minority. Yeah. So that brings us to the current"
    },
    {
      "speaker": 2,
      "start": 492.08,
      "end": 496.82,
      "text": " moment where the machine behind your screen that′s going to try and answer your questions"
    },
    {
      "speaker": 2,
      "start": 496.88,
      "end": 502.18,
      "text": " is suddenly, and I really mean suddenly, able to answer it almost like a human it feels like at"
    },
    {
      "speaker": 0,
      "start": 502.18,
      "end": 508.36,
      "text": " times. I agree. I think it′s a sea change. So I gave a keynote talk in October to the Information"
    },
    {
      "speaker": 0,
      "start": 508.36,
      "end": 514.28,
      "text": " Visualization Society, the IEEE Society. And in that talk, part of what I did was talked about,"
    },
    {
      "speaker": 0,
      "start": 514.6,
      "end": 519.7,
      "text": " you know, this is coming. We are going to see, instead of people developing visualizations"
    },
    {
      "speaker": 0,
      "start": 519.7,
      "end": 524.32,
      "text": " manually, it′s probably going to be done with text interface. And that′s a pretty radical"
    },
    {
      "speaker": 0,
      "start": 524.32,
      "end": 529.94,
      "text": " thing to say. And it was a month later that ChatGPT came out. And again, I told the audience"
    },
    {
      "speaker": 0,
      "start": 529.94,
      "end": 535.74,
      "text": " at that time that I′ve been in the NLP field for more than 25 years, maybe 30 years, and I′ve never"
    },
    {
      "speaker": 0,
      "start": 535.74,
      "end": 541.54,
      "text": " said this is a major change. And I say it now, I was saying it right before ChatGPT,"
    },
    {
      "speaker": 0,
      "start": 541.84,
      "end": 547.98,
      "text": " and it is transformational in terms of what we can do with processing language and producing"
    },
    {
      "speaker": 0,
      "start": 547.98,
      "end": 553.5,
      "text": " language. It′s not transformational in everything, as some of the hype says. Just like we had a"
    },
    {
      "speaker": 0,
      "start": 553.5,
      "end": 560.06,
      "text": " mouse, and then we had a touchscreen. We had keyword query or statistical ranking, or we had"
    },
    {
      "speaker": 0,
      "start": 560.06,
      "end": 565.24,
      "text": " these very complex pipelines for making natural language processing systems. And now it′s kind"
    },
    {
      "speaker": 0,
      "start": 565.24,
      "end": 571.94,
      "text": " of one relatively simple architecture that does everything as opposed to specific algorithms."
    },
    {
      "speaker": 2,
      "start": 572.36,
      "end": 578.58,
      "text": " And it′s kind of head spinning, really. Well, simple schematically, but very complicated in"
    },
    {
      "speaker": 2,
      "start": 578.58,
      "end": 581.64,
      "text": " terms of what structure might be hidden in all those billions of neurons."
    },
    {
      "speaker": 0,
      "start": 582.14,
      "end": 585.9,
      "text": " Yeah, it′s simple in terms of what the people have to do and complex in terms of what the"
    },
    {
      "speaker": 0,
      "start": 585.9,
      "end": 590.18,
      "text": " program is doing. I actually have an example that I was just trying last night, because"
    },
    {
      "speaker": 0,
      "start": 590.18,
      "end": 595.74,
      "text": " in the same talk, I gave an example of comparatives being very difficult to process automatically."
    },
    {
      "speaker": 2,
      "start": 595.94,
      "end": 596.4,
      "text": " What′s a comparative?"
    },
    {
      "speaker": 0,
      "start": 596.84,
      "end": 602.44,
      "text": " So if you have, say, a review of a camera and someone in their regular casual language is"
    },
    {
      "speaker": 0,
      "start": 602.44,
      "end": 611.18,
      "text": " saying, oh, the DLSR has a wider angle, but the pixels are not as crisply retained. What are they"
    },
    {
      "speaker": 0,
      "start": 611.18,
      "end": 616.5,
      "text": " saying is better than what? There′s a lot implied there, and there′s an implicit comparison"
    },
    {
      "speaker": 0,
      "start": 616.5,
      "end": 621.84,
      "text": " between kind of the overall merits of some camera and then these specific components,"
    },
    {
      "speaker": 0,
      "start": 622.36,
      "end": 626.78,
      "text": " the pixels and so on. And I used that as an example of something that would be very hard to"
    },
    {
      "speaker": 0,
      "start": 626.78,
      "end": 631.78,
      "text": " write an algorithm to process automatically. And one of the reviewers of the paper that I wrote"
    },
    {
      "speaker": 0,
      "start": 631.78,
      "end": 635.64,
      "text": " said, yeah, that was true, but I just put this in ChatGPT and it worked really well."
    },
    {
      "speaker": 0,
      "start": 635.88,
      "end": 642.64,
      "text": " So last night, I put all these super complex descriptions of reviews of cameras in ChatGPT,"
    },
    {
      "speaker": 0,
      "start": 642.74,
      "end": 647.3,
      "text": " and it did an amazing job of saying what was being compared to what. But I still say that"
    },
    {
      "speaker": 0,
      "start": 647.3,
      "end": 652.58,
      "text": " it would be very hard to write an algorithm to process the language to do that. It′s a general"
    },
    {
      "speaker": 0,
      "start": 652.58,
      "end": 656.46,
      "text": " purpose tool that does that as a side effect of what else it does."
    },
    {
      "speaker": 2,
      "start": 656.86,
      "end": 659.26,
      "text": " Yeah, it′s sort of an all-purpose reasoning machine."
    },
    {
      "speaker": 0,
      "start": 659.56,
      "end": 661.74,
      "text": " It′s something. I don′t know what it is."
    },
    {
      "speaker": 2,
      "start": 662.88,
      "end": 669.0,
      "text": " So I watched your keynote and found it really, really remarkable. And something that was"
    },
    {
      "speaker": 2,
      "start": 669.0,
      "end": 674.1,
      "text": " gestating in my mind as I watched you walk through all the latest research that you could"
    },
    {
      "speaker": 2,
      "start": 674.1,
      "end": 680.86,
      "text": " dig up on the human-computer interface and also language and the visual component of people trying"
    },
    {
      "speaker": 2,
      "start": 680.86,
      "end": 686.7,
      "text": " to understand complex topics was that we′re probably soon heading into a world where you"
    },
    {
      "speaker": 2,
      "start": 686.7,
      "end": 693.64,
      "text": " essentially go to a whiteboard with a model like ChatGPT. So at work, when I need to understand"
    },
    {
      "speaker": 2,
      "start": 693.64,
      "end": 698.58,
      "text": " something really complicated or communicate something really complicated or collaborate"
    },
    {
      "speaker": 2,
      "start": 698.58,
      "end": 703.36,
      "text": " with someone on a really complicated problem, we go to the whiteboard. It′s sort of the best"
    },
    {
      "speaker": 2,
      "start": 703.36,
      "end": 706.82,
      "text": " environment to do this. What that means is you have all the affordances of language,"
    },
    {
      "speaker": 2,
      "start": 707.2,
      "end": 711.02,
      "text": " just speaking one-on-one, and you also have this whiteboard next to you that you can"
    },
    {
      "speaker": 2,
      "start": 711.18,
      "end": 716.56,
      "text": " diagram things, correct things, point things out visually. And so it′s sort of maximum bandwidth,"
    },
    {
      "speaker": 2,
      "start": 716.84,
      "end": 722.7,
      "text": " and it feels like the most comfortable way to navigate really complicated things. I think that"
    },
    {
      "speaker": 2,
      "start": 722.7,
      "end": 728.04,
      "text": " we′ve clearly gone way down the road of the chat side of this, the language side of this."
    },
    {
      "speaker": 2,
      "start": 728.5,
      "end": 732.08,
      "text": " You can interact with ChatGPT and talk about really complicated things,"
    },
    {
      "speaker": 2,
      "start": 732.26,
      "end": 741.0,
      "text": " maybe even solve problems together. But there isn′t yet that whiteboard, but I think it′s"
    },
    {
      "speaker": 2,
      "start": 741.0,
      "end": 747.18,
      "text": " safe to say that we′re headed towards AI whiteboards. And you have been grappling with"
    },
    {
      "speaker": 2,
      "start": 747.18,
      "end": 754.58,
      "text": " the nuts and bolts of how you communicate both visually and with language, and how the two play"
    },
    {
      "speaker": 2,
      "start": 754.58,
      "end": 759.92,
      "text": " off each other, sometimes synergistically. I′d love to pick your brain just on what it′s going"
    },
    {
      "speaker": 2,
      "start": 759.92,
      "end": 764.6,
      "text": " to mean heading into a world of AI whiteboards. And of course, it goes way beyond whiteboards."
    },
    {
      "speaker": 2,
      "start": 764.66,
      "end": 769.6,
      "text": " It can show you arbitrary images, videos it generates, things it finds from the internet,"
    },
    {
      "speaker": 2,
      "start": 769.6,
      "end": 772.68,
      "text": " and actually points things out and illustrates it."
    },
    {
      "speaker": 0,
      "start": 773.02,
      "end": 778.26,
      "text": " Yeah, I think that there′s a lot of potential for these tools, these large language model-based"
    },
    {
      "speaker": 0,
      "start": 778.26,
      "end": 783.64,
      "text": " tools, to be collaborators in thinking. I think that′s what you mean by the whiteboard."
    },
    {
      "speaker": 2,
      "start": 783.66,
      "end": 783.98,
      "text": " Yeah."
    },
    {
      "speaker": 2,
      "start": 784.14,
      "end": 790.6,
      "text": " But after I had done my keynote, I did actually ask ChatGPT to make an outline of a talk on the"
    },
    {
      "speaker": 2,
      "start": 790.6,
      "end": 795.04,
      "text": " subject that I had selected. And it was not very creative. It said things that made sense,"
    },
    {
      "speaker": 2,
      "start": 795.04,
      "end": 799.62,
      "text": " but it would have been, I guess, somebody who kind of knew the field, but was not"
    },
    {
      "speaker": 2,
      "start": 799.62,
      "end": 804.76,
      "text": " innovating, was not seeing the future. And so, I don′t know that it′s capable of doing that."
    },
    {
      "speaker": 2,
      "start": 805.18,
      "end": 810.78,
      "text": " Yet, I listened to the interview with Sergey, and he, here at Berkeley, Sergey Levin on"
    },
    {
      "speaker": 2,
      "start": 810.78,
      "end": 815.32,
      "text": " reinforcement learning, and he kind of pointed out that it′s not using technology to"
    },
    {
      "speaker": 2,
      "start": 815.32,
      "end": 819.76,
      "text": " kind of do future sequencing. But they′re working on it, I guess, or they might work on it."
    },
    {
      "speaker": 2,
      "start": 819.94,
      "end": 823.22,
      "text": " Yeah. No doubt the human is going to have to do most of the intellectual heavy lifting"
    },
    {
      "speaker": 2,
      "start": 823.38,
      "end": 829.84,
      "text": " in the beginning. I mean, what is it going to mean for information sharing and explaining when we can"
    },
    {
      "speaker": 2,
      "start": 829.84,
      "end": 834.44,
      "text": " use something as powerful as ChatGPT in the language regime, also in the visual regime?"
    },
    {
      "speaker": 0,
      "start": 834.96,
      "end": 839.08,
      "text": " Yeah. So, and referring back to that keynote a bit, the topic is the intersection of language"
    },
    {
      "speaker": 0,
      "start": 839.08,
      "end": 844.22,
      "text": " and visualization. Because the information visualization community focuses reasonably"
    },
    {
      "speaker": 0,
      "start": 844.22,
      "end": 848.38,
      "text": " on how to visualize data, how to visualize information. And there′s been less of a"
    },
    {
      "speaker": 0,
      "start": 848.38,
      "end": 853.94,
      "text": " focus of how does language or text overlay on that or interact with that. And I mentioned this"
    },
    {
      "speaker": 0,
      "start": 853.94,
      "end": 859.04,
      "text": " in our earlier conversation with John, that for many semesters or many years, I was teaching"
    },
    {
      "speaker": 0,
      "start": 859.04,
      "end": 863.38,
      "text": " natural language processing in the fall and information visualization in the spring,"
    },
    {
      "speaker": 0,
      "start": 863.72,
      "end": 868.84,
      "text": " and thinking about what sort of information can be represented in each modality. And can you"
    },
    {
      "speaker": 0,
      "start": 868.84,
      "end": 873.78,
      "text": " convert one to the other directly? And I think the answer is no. They show or they explain different"
    },
    {
      "speaker": 0,
      "start": 874.32,
      "end": 878.78,
      "text": " visuals, explain different things than text. And if you think about the movie versus the book,"
    },
    {
      "speaker": 0,
      "start": 878.86,
      "end": 883.34,
      "text": " that′s like the best example. There are some books written to be made into movies. You think"
    },
    {
      "speaker": 0,
      "start": 883.34,
      "end": 887.66,
      "text": " about the Harry Potter series, for example, and they′re very true to the original, I think. But"
    },
    {
      "speaker": 0,
      "start": 887.66,
      "end": 894.04,
      "text": " there′s a lot that don′t transfer so well. And a lot of it is about interiority and mood and things"
    },
    {
      "speaker": 0,
      "start": 894.04,
      "end": 898.06,
      "text": " like that, that mood is expressed differently with words than with images. And they complement"
    },
    {
      "speaker": 0,
      "start": 898.06,
      "end": 902.76,
      "text": " each other, of course, which is why the soundtrack is so important for the film. When you become a"
    },
    {
      "speaker": 0,
      "start": 902.76,
      "end": 904.38,
      "text": " novelist, you don′t have to write pictures in your novels anymore."
    },
    {
      "speaker": 2,
      "start": 904.6,
      "end": 909.0,
      "text": " Except you pointed out in your keynote that really lovely classic book by Scott McCloud"
    },
    {
      "speaker": 2,
      "start": 909.0,
      "end": 914.72,
      "text": " on how comic books work. You pointed out that there′s a method to it. There′s a kind of"
    },
    {
      "speaker": 2,
      "start": 914.72,
      "end": 919.42,
      "text": " balance between the visual and the language. And sometimes one can do most of the work and"
    },
    {
      "speaker": 2,
      "start": 919.42,
      "end": 921.6,
      "text": " sometimes the other. Couldn′t a model learn to do that?"
    },
    {
      "speaker": 0,
      "start": 921.9,
      "end": 925.78,
      "text": " Oh, well, could a model learn to do that? I mean, I think you could give it instructions to learn to"
    },
    {
      "speaker": 0,
      "start": 925.78,
      "end": 930.1,
      "text": " do that. I think right now what I′m interested in is how do people understand these things"
    },
    {
      "speaker": 0,
      "start": 930.24,
      "end": 937.04,
      "text": " and then how best to express information so that you promote understanding and you don′t promote"
    },
    {
      "speaker": 0,
      "start": 937.04,
      "end": 941.6,
      "text": " misinformation or you try to combat misinformation. I think it′s really important that we understand"
    },
    {
      "speaker": 0,
      "start": 941.6,
      "end": 947.98,
      "text": " how, and this is the human computer interaction, the HCI side of the AI HCI coin as I think about"
    },
    {
      "speaker": 0,
      "start": 947.98,
      "end": 952.84,
      "text": " them, understanding how people understand things so that we know what to tell the computers to do."
    },
    {
      "speaker": 0,
      "start": 953.14,
      "end": 957.54,
      "text": " Right now we have people designing visualizations and they don′t necessarily know how to put the"
    },
    {
      "speaker": 0,
      "start": 957.54,
      "end": 962.6,
      "text": " design into language and neither will probably the computer. Or if the computer does know,"
    },
    {
      "speaker": 0,
      "start": 962.66,
      "end": 966.64,
      "text": " we at least need to know how to assess if it did a good job or not, which I think we need to do more"
    },
    {
      "speaker": 2,
      "start": 966.64,
      "end": 972.06,
      "text": " work on. Yeah. But just to go out one step out onto the limb, I know you′re very wary of speculation,"
    },
    {
      "speaker": 2,
      "start": 972.44,
      "end": 977.12,
      "text": " but this one feels like a safe speculation. I think that there are going to be emergent"
    },
    {
      "speaker": 2,
      "start": 977.12,
      "end": 982.9,
      "text": " capabilities with multimodal models that can deal both with the visual and the language side."
    },
    {
      "speaker": 2,
      "start": 983.22,
      "end": 988.72,
      "text": " We don′t know exactly what they′ll be, but if we follow the trend with GPT-3 solely on the"
    },
    {
      "speaker": 2,
      "start": 988.72,
      "end": 994.5,
      "text": " language side, I wonder what kind of capabilities even are there to acquire on the visual side."
    },
    {
      "speaker": 2,
      "start": 994.96,
      "end": 1000.3,
      "text": " Something that comes to my mind is simplifying something visually. Sometimes as simple as"
    },
    {
      "speaker": 2,
      "start": 1000.3,
      "end": 1005.36,
      "text": " underlining something can make something salient that helps explain the whole."
    },
    {
      "speaker": 2,
      "start": 1005.62,
      "end": 1010.44,
      "text": " You have a project called ScholarPHY with Andrew Head at Berkeley. Is he a student of yours?"
    },
    {
      "speaker": 0,
      "start": 1010.52,
      "end": 1013.9,
      "text": " He was a student and a postdoc, and now he′s a professor at UPenn."
    },
    {
      "speaker": 0,
      "start": 1014.2,
      "end": 1018.9,
      "text": " And it was a collaboration with people at AI2, hence the Oren reference."
    },
    {
      "speaker": 2,
      "start": 1019.18,
      "end": 1024.86,
      "text": " I saw a breakdown of the project. It′s so neat. One of the really neat insights is when you read"
    },
    {
      "speaker": 2,
      "start": 1024.86,
      "end": 1028.9,
      "text": " something that′s got a lot of complicated mathematics in it, your brain is doing a ton"
    },
    {
      "speaker": 2,
      "start": 1028.9,
      "end": 1034.4,
      "text": " of work behind the scenes. If you had a better interface, for example, click on a variable in"
    },
    {
      "speaker": 2,
      "start": 1034.4,
      "end": 1038.92,
      "text": " a formula and just have it automatically pop out and say, this is what that represents."
    },
    {
      "speaker": 2,
      "start": 1038.92,
      "end": 1042.12,
      "text": " So you offload some of that cognitive work you have to do."
    },
    {
      "speaker": 2,
      "start": 1042.52,
      "end": 1045.26,
      "text": " I wonder if those kind of skills could be learned."
    },
    {
      "speaker": 0,
      "start": 1045.76,
      "end": 1049.24,
      "text": " I hope so. And you mean the skills of visually showing the information?"
    },
    {
      "speaker": 2,
      "start": 1049.66,
      "end": 1053.64,
      "text": " Yeah. All those tricks that a good visual explainer just knows how to do."
    },
    {
      "speaker": 0,
      "start": 1054.02,
      "end": 1059.16,
      "text": " Well, I am optimistic that these new models will make that automation task that we had"
    },
    {
      "speaker": 0,
      "start": 1059.16,
      "end": 1065.28,
      "text": " more effective. We worked on algorithms to do it automatically, but PDFs are really tricky"
    },
    {
      "speaker": 0,
      "start": 1065.28,
      "end": 1069.56,
      "text": " to process if you′re looking at the image level. And it′s very hard to find definitions"
    },
    {
      "speaker": 0,
      "start": 1069.56,
      "end": 1074.26,
      "text": " within a scientific paper because not everything is defined in a crisp way. And so really what you"
    },
    {
      "speaker": 0,
      "start": 1074.26,
      "end": 1078.94,
      "text": " want to do is generate your own text, but you want it to be accurate. It′s based on the text"
    },
    {
      "speaker": 0,
      "start": 1078.94,
      "end": 1083.16,
      "text": " of the paper. So we are actually looking to see if the latest models can help with the automation"
    },
    {
      "speaker": 0,
      "start": 1083.16,
      "end": 1089.22,
      "text": " of that task. But going back to a point you made earlier about creativity or new synthesis with"
    },
    {
      "speaker": 0,
      "start": 1089.22,
      "end": 1093.66,
      "text": " these models, I think someone who was hosted earlier on this podcast pointed out just even"
    },
    {
      "speaker": 0,
      "start": 1093.66,
      "end": 1100.32,
      "text": " the avocado sofa is a synergy of image. A human had to ask the query, but then the system was able"
    },
    {
      "speaker": 0,
      "start": 1100.32,
      "end": 1106.4,
      "text": " to blend these images together into something new. Although it doesn′t blend well if they don′t go"
    },
    {
      "speaker": 2,
      "start": 1106.4,
      "end": 1111.64,
      "text": " well together. In case anyone listening doesn′t know what the avocado chair is, this was the sort"
    },
    {
      "speaker": 2,
      "start": 1111.64,
      "end": 1117.4,
      "text": " of amazing DALI moment. So the DALI model came with a paper, and in that paper they had some"
    },
    {
      "speaker": 2,
      "start": 1117.4,
      "end": 1122.34,
      "text": " images as examples of what it could do. And one of them was make a chair made of an avocado,"
    },
    {
      "speaker": 2,
      "start": 1122.34,
      "end": 1127.38,
      "text": " something like that. And it was sort of amazingly convincingly good. It really was."
    },
    {
      "speaker": 0,
      "start": 1127.52,
      "end": 1130.76,
      "text": " Yeah, although they are a little cherry picked because if you try to combine two things that"
    },
    {
      "speaker": 0,
      "start": 1130.76,
      "end": 1135.24,
      "text": " don′t often go well together or don′t appear together, it doesn′t work, or at least it didn′t"
    },
    {
      "speaker": 0,
      "start": 1135.24,
      "end": 1136.64,
      "text": " work when I was playing. It′ll flub it."
    },
    {
      "speaker": 0,
      "start": 1136.92,
      "end": 1142.72,
      "text": " Yeah. But still, it′s a great example of synergy with these tools. And what I noted in the keynote"
    },
    {
      "speaker": 0,
      "start": 1142.72,
      "end": 1147.86,
      "text": " was that co-pilot these systems that aid in programming rather than, you know, there′s"
    },
    {
      "speaker": 0,
      "start": 1147.86,
      "end": 1153.08,
      "text": " been a long debate in HCI about when you′re developing, say, a user interface or doing data"
    },
    {
      "speaker": 0,
      "start": 1153.08,
      "end": 1158.28,
      "text": " analysis, should it be a command line or should it be a graphical user interface, a GUI? And of"
    },
    {
      "speaker": 0,
      "start": 1158.28,
      "end": 1163.28,
      "text": " course the answer is neither works perfectly, and people who are practitioners use a blend of both."
    },
    {
      "speaker": 0,
      "start": 1163.44,
      "end": 1168.86,
      "text": " But it seems now, as I said about Ask Jeeves, what people really want to do is just use language to"
    },
    {
      "speaker": 0,
      "start": 1168.86,
      "end": 1173.76,
      "text": " say, do this, do that, and have the program get written. And then point and use gestures in the"
    },
    {
      "speaker": 0,
      "start": 1173.76,
      "end": 1180.28,
      "text": " interface to tweak it a bit, this multimodality. And again, there are tools to do that, but they′re"
    },
    {
      "speaker": 0,
      "start": 1180.28,
      "end": 1188.12,
      "text": " just not perfect. And the more that the algorithms improve, like with ChatGPT, the more effectively"
    },
    {
      "speaker": 0,
      "start": 1188.12,
      "end": 1193.58,
      "text": " we′ll be able to help people design visualizations where they don′t have to do a lot of coding."
    },
    {
      "speaker": 0,
      "start": 1193.96,
      "end": 1199.7,
      "text": " It′s again, because it works, this general purpose tool that we′re talking about, as a side effect"
    },
    {
      "speaker": 0,
      "start": 1199.88,
      "end": 1203.7,
      "text": " of being, you know, produce the next word, it′s able to do all these other things,"
    },
    {
      "speaker": 0,
      "start": 1203.78,
      "end": 1208.76,
      "text": " and I think we don′t understand why, but that includes writing code or, you know, being smart"
    },
    {
      "speaker": 0,
      "start": 1208.76,
      "end": 1213.92,
      "text": " about adding things into code and so on. It wasn′t designed for that, but it seems like it will be"
    },
    {
      "speaker": 0,
      "start": 1213.92,
      "end": 1219.54,
      "text": " very effective at making it easier to design visualizations. The problem is, will it design"
    },
    {
      "speaker": 0,
      "start": 1219.54,
      "end": 1223.38,
      "text": " good visualizations? And, you know, that′s where we still have the human component."
    },
    {
      "speaker": 2,
      "start": 1223.8,
      "end": 1228.08,
      "text": " Well, I think the safe way to use these things is to generate first drafts and iterate,"
    },
    {
      "speaker": 2,
      "start": 1228.1,
      "end": 1232.48,
      "text": " but that you have to be the human editor who makes the final call and do the driving."
    },
    {
      "speaker": 0,
      "start": 1232.86,
      "end": 1238.42,
      "text": " Yeah, I agree. The work that we all do in the viz field can help determine what makes a good"
    },
    {
      "speaker": 0,
      "start": 1238.42,
      "end": 1243.02,
      "text": " design, help give guidelines. We do research, empirical research, and then we produce guidelines"
    },
    {
      "speaker": 0,
      "start": 1243.02,
      "end": 1244.84,
      "text": " for practitioners to follow."
    },
    {
      "speaker": 2,
      "start": 1245.2,
      "end": 1250.96,
      "text": " So, bringing this all back to this moment, you′re a natural language processing practitioner. You′ve"
    },
    {
      "speaker": 2,
      "start": 1250.96,
      "end": 1255.94,
      "text": " spent years trying to teach machines to do useful things with language. And here we are,"
    },
    {
      "speaker": 2,
      "start": 1255.94,
      "end": 1261.44,
      "text": " in a moment where, I don′t know about you, but I feel like, wow, a lot of the things we solved,"
    },
    {
      "speaker": 2,
      "start": 1262.22,
      "end": 1267.6,
      "text": " you don′t have to worry about anymore. Just sort of more and more and more of all that hard,"
    },
    {
      "speaker": 2,
      "start": 1267.72,
      "end": 1274.82,
      "text": " algorithmic, hand-rolled feature engineering world is getting eaten up by large language"
    },
    {
      "speaker": 2,
      "start": 1274.82,
      "end": 1281.5,
      "text": " models that can simply speak. And they seem to have cognitive abilities that we would never have"
    },
    {
      "speaker": 2,
      "start": 1281.5,
      "end": 1283.26,
      "text": " dreamed would be in a machine."
    },
    {
      "speaker": 0,
      "start": 1283.46,
      "end": 1287.68,
      "text": " Well, I′m not going there with you on the cognitive abilities that I′m very cautious"
    },
    {
      "speaker": 0,
      "start": 1287.68,
      "end": 1288.56,
      "text": " and skeptical about."
    },
    {
      "speaker": 2,
      "start": 1288.58,
      "end": 1289.76,
      "text": " What should we call them? Behaviors?"
    },
    {
      "speaker": 0,
      "start": 1290.34,
      "end": 1295.2,
      "text": " I guess I don′t have my favorite word for it yet. Capabilities. It works a lot better than it used"
    },
    {
      "speaker": 0,
      "start": 1295.2,
      "end": 1299.34,
      "text": " to work. There′s a lot of people looking into, you know, why does it work? But, you know, each"
    },
    {
      "speaker": 0,
      "start": 1299.34,
      "end": 1303.92,
      "text": " time people start to make some progress on that, then a new model comes out that′s even harder"
    },
    {
      "speaker": 0,
      "start": 1303.92,
      "end": 1308.3,
      "text": " to understand because the scale is so much larger and we′re not good at thinking at a very large"
    },
    {
      "speaker": 0,
      "start": 1308.3,
      "end": 1313.1,
      "text": " scale. So, I think it′s going to take years before we understand what′s going on. I don′t"
    },
    {
      "speaker": 0,
      "start": 1313.1,
      "end": 1318.52,
      "text": " think it′s cognition. I′m very skeptical about that. It′s really, I mean, you know, we get into"
    },
    {
      "speaker": 0,
      "start": 1318.52,
      "end": 1324.58,
      "text": " philosophy and the Chinese room, that′s an old John Searle thought experiment. I mean, it′s"
    },
    {
      "speaker": 0,
      "start": 1324.58,
      "end": 1329.74,
      "text": " unfortunate, I guess, the use of Chinese in that particular example. But the idea being if you"
    },
    {
      "speaker": 0,
      "start": 1329.74,
      "end": 1335.24,
      "text": " replace each piece of your brain with a little, like, component, electronic component, and you"
    },
    {
      "speaker": 0,
      "start": 1335.24,
      "end": 1339.14,
      "text": " eventually replace every piece, is it still a brain? You know, are you still thinking? There′s"
    },
    {
      "speaker": 0,
      "start": 1339.24,
      "end": 1344.72,
      "text": " philosophy thought experiments. You might want to say, oh, well, this model that′s basically just"
    },
    {
      "speaker": 0,
      "start": 1344.72,
      "end": 1348.86,
      "text": " a bunch of numbers, a bunch of weights that have been trained, is thinking because you can say that"
    },
    {
      "speaker": 0,
      "start": 1348.86,
      "end": 1353.14,
      "text": " about the brain. But, you know, I′m not convinced. I think there′s a lot more going on in the brain"
    },
    {
      "speaker": 0,
      "start": 1353.14,
      "end": 1356.96,
      "text": " than is going on in these models. I agree with you. They′re very good at mimicking, you know,"
    },
    {
      "speaker": 2,
      "start": 1356.96,
      "end": 1361.92,
      "text": " at producing language and because language is distinctly human, it feels, you know, to a lot"
    },
    {
      "speaker": 2,
      "start": 1361.92,
      "end": 1367.1,
      "text": " of people like it′s human. When people are driving in their cars, they name their car, even old cars"
    },
    {
      "speaker": 2,
      "start": 1367.1,
      "end": 1370.8,
      "text": " that had no electronic components. They would name their cars. They would anthropomorphize their"
    },
    {
      "speaker": 2,
      "start": 1370.8,
      "end": 1375.26,
      "text": " cars. They feel a part of their cars. This is what we do with technology. People are going to get"
    },
    {
      "speaker": 2,
      "start": 1375.26,
      "end": 1379.7,
      "text": " used to it and then it′s going to become old news. And I think it′s great that we don′t have to"
    },
    {
      "speaker": 2,
      "start": 1379.7,
      "end": 1385.48,
      "text": " write all these tokenizers. The LP pipeline didn′t work. It was a mess. And there′s always new"
    },
    {
      "speaker": 2,
      "start": 1385.48,
      "end": 1390.12,
      "text": " problems and new questions to investigate from a research perspective. Researchers will not be out"
    },
    {
      "speaker": 2,
      "start": 1390.12,
      "end": 1397.46,
      "text": " of business. Of course, it does raise even more societal issues and dangers because of the ability"
    },
    {
      "speaker": 2,
      "start": 1397.46,
      "end": 1403.34,
      "text": " to fake information, to spread misinformation, and for people to not know what′s real and what′s"
    },
    {
      "speaker": 2,
      "start": 1403.34,
      "end": 1407.28,
      "text": " true. So we′re living through a very chaotic moment right now. I think we′re going to look"
    },
    {
      "speaker": 2,
      "start": 1407.28,
      "end": 1411.22,
      "text": " back 10 years from now and we′re going to go, wow, that was a chaotic time in technology. That"
    },
    {
      "speaker": 2,
      "start": 1411.22,
      "end": 1415.92,
      "text": " was a chaotic time politically. And hopefully we′ll be able to look back and say, thank goodness we"
    },
    {
      "speaker": 2,
      "start": 1415.92,
      "end": 1422.54,
      "text": " made it through. I have optimistic we will. Well, the curve you′re describing is pretty smooth."
    },
    {
      "speaker": 2,
      "start": 1423.04,
      "end": 1428.42,
      "text": " It implies that there′s going to be another side to this. But if things keep exponentially changing,"
    },
    {
      "speaker": 2,
      "start": 1428.86,
      "end": 1433.92,
      "text": " there won′t necessarily be that moment because it′ll always feel like it does right now."
    },
    {
      "speaker": 0,
      "start": 1434.32,
      "end": 1440.1,
      "text": " Well, the technology that this breakthrough with these models and really with training on huge"
    },
    {
      "speaker": 0,
      "start": 1440.1,
      "end": 1445.14,
      "text": " amounts of compute, huge amounts of data, I think it can only go so far. We don′t know the limits"
    },
    {
      "speaker": 0,
      "start": 1445.14,
      "end": 1449.52,
      "text": " of it, but it′s not going to be everything. If you look at people that are trying to study the"
    },
    {
      "speaker": 0,
      "start": 1449.52,
      "end": 1453.94,
      "text": " brain, you know, there′s other things going on there, different kinds of structure and so on."
    },
    {
      "speaker": 2,
      "start": 1454.14,
      "end": 1455.26,
      "text": " You think we′re running out of data?"
    },
    {
      "speaker": 0,
      "start": 1455.88,
      "end": 1461.48,
      "text": " No, no, I don′t think that′s it. I think that the technique, it′s a very specific technique."
    },
    {
      "speaker": 0,
      "start": 1461.8,
      "end": 1467.34,
      "text": " That alone I don′t think is going to be sufficient for being the same as humans. I don′t say we"
    },
    {
      "speaker": 2,
      "start": 1467.34,
      "end": 1471.3,
      "text": " could ever do it. Some people do argue that sequence prediction, which is essentially"
    },
    {
      "speaker": 2,
      "start": 1471.72,
      "end": 1475.84,
      "text": " what is driving this whole craze, might be all you need. What do you think about that?"
    },
    {
      "speaker": 0,
      "start": 1476.48,
      "end": 1479.4,
      "text": " Well, it′s certainly all you need for certain tasks. We′re seeing that now. It′s"
    },
    {
      "speaker": 0,
      "start": 1479.4,
      "end": 1483.96,
      "text": " really quite amazing. There is sometimes fine-tuning on the other side, but again,"
    },
    {
      "speaker": 0,
      "start": 1484.26,
      "end": 1488.84,
      "text": " who knows? I personally have been wrong about this particular technology. I think like a lot"
    },
    {
      "speaker": 0,
      "start": 1488.84,
      "end": 1492.86,
      "text": " of people, I just didn′t know how to think in terms of billions of parameters and we′re just"
    },
    {
      "speaker": 0,
      "start": 1492.86,
      "end": 1497.76,
      "text": " not good at that. There were some very ambitious people that just sort of went for it and surprised"
    },
    {
      "speaker": 0,
      "start": 1497.76,
      "end": 1503.94,
      "text": " all of us. I admit it, I did not see this coming and I was surprised by it. We have certainly in"
    },
    {
      "speaker": 0,
      "start": 1503.94,
      "end": 1509.68,
      "text": " the research community, it′s been developing gradually. Word2Vec came along. Going back even"
    },
    {
      "speaker": 0,
      "start": 1509.68,
      "end": 1516.02,
      "text": " farther, again, when I was doing early in the statistical NLP time, people were looking at SVDs,"
    },
    {
      "speaker": 0,
      "start": 1516.16,
      "end": 1520.72,
      "text": " singular value decomposition, and LSA, latent semantic analysis, which is similar in a lot of"
    },
    {
      "speaker": 0,
      "start": 1520.72,
      "end": 1525.7,
      "text": " ways. It was putting words in a matrix, well, words by document matrices and trying to find"
    },
    {
      "speaker": 0,
      "start": 1525.8,
      "end": 1531.98,
      "text": " similarities. Even before that, I was trying to solve the thesaurus or the synonym problem to help"
    },
    {
      "speaker": 0,
      "start": 1531.98,
      "end": 1538.12,
      "text": " with search. In search, you look for cat and it′s really feline and you don′t find anything. Going"
    },
    {
      "speaker": 2,
      "start": 1538.12,
      "end": 1541.02,
      "text": " back to the beginning of our conversation... And you didn′t want users to have to put in"
    },
    {
      "speaker": 2,
      "start": 1541.02,
      "end": 1547.0,
      "text": " every synonym imaginable for a cat just to find text about cats. Well, library catalogs had"
    },
    {
      "speaker": 0,
      "start": 1547.0,
      "end": 1549.86,
      "text": " synonyms in the early days. They weren′t that good, they weren′t dynamic, they didn′t handle"
    },
    {
      "speaker": 0,
      "start": 1549.86,
      "end": 1555.3,
      "text": " new technology and they were hard to use. WordNet came along and developed as a linguistic tool and"
    },
    {
      "speaker": 0,
      "start": 1555.3,
      "end": 1560.48,
      "text": " was the first person to download it, actually, when they had an FTP available. I did work on that and"
    },
    {
      "speaker": 0,
      "start": 1560.48,
      "end": 1565.08,
      "text": " it was like, oh, we can have a thesaurus. But it never worked. Whenever you had automatically"
    },
    {
      "speaker": 0,
      "start": 1565.08,
      "end": 1571.04,
      "text": " recommended terms for a term, some of them were right and some were wrong. That was true of SVD"
    },
    {
      "speaker": 0,
      "start": 1571.04,
      "end": 1575.72,
      "text": " and LSA as well. They worked in some cases, they didn′t work in other cases. It wasn′t until"
    },
    {
      "speaker": 0,
      "start": 1575.72,
      "end": 1581.28,
      "text": " Word2Vec came along and then people actually refined it to have different senses that it"
    },
    {
      "speaker": 0,
      "start": 1581.28,
      "end": 1587.8,
      "text": " actually started to work. I was saying, wow, this actually works and I′ve seen 20 years of this not"
    },
    {
      "speaker": 0,
      "start": 1587.8,
      "end": 1593.72,
      "text": " working. Of course, that kept being refined and being made more sophisticated with the"
    },
    {
      "speaker": 2,
      "start": 1593.72,
      "end": 1597.94,
      "text": " transformers came along and now the really large things. In the research community, it′s been"
    },
    {
      "speaker": 2,
      "start": 1597.94,
      "end": 1603.3,
      "text": " happening gradually. There were a lot of debates about counting versus probabilities and all this."
    },
    {
      "speaker": 2,
      "start": 1604.02,
      "end": 1610.5,
      "text": " It′s not out of the blue, but I do, again, I admit that in this last year between the"
    },
    {
      "speaker": 2,
      "start": 1610.86,
      "end": 1615.7,
      "text": " combination of the image plus text generation and these language models where the input could be"
    },
    {
      "speaker": 2,
      "start": 1615.7,
      "end": 1620.54,
      "text": " text, we never thought the input could be text and then the output would be all these things."
    },
    {
      "speaker": 2,
      "start": 1620.68,
      "end": 1624.06,
      "text": " We thought we had to program things. I don′t think the people who developed these models"
    },
    {
      "speaker": 2,
      "start": 1624.06,
      "end": 1630.66,
      "text": " expected that either. I believe it was a surprise to them. It is different now. I don′t think"
    },
    {
      "speaker": 2,
      "start": 1630.66,
      "end": 1637.18,
      "text": " everything is solved. I don′t think it′s AGI, but the tools are much more effective than they used to be."
    },
    {
      "speaker": 2,
      "start": 1637.18,
      "end": 1642.96,
      "text": " Well, like you said, it′s all about capabilities. It turns out if you teach a very big neural"
    },
    {
      "speaker": 2,
      "start": 1642.96,
      "end": 1647.84,
      "text": " network how to predict the next word on a huge amount of internet text, all these really neat"
    },
    {
      "speaker": 2,
      "start": 1647.84,
      "end": 1652.02,
      "text": " emergent capabilities come into your hands. It couldn′t have been predicted. In fact,"
    },
    {
      "speaker": 2,
      "start": 1652.08,
      "end": 1656.66,
      "text": " no one really thought it would work as well as it does, I′m sure, but it does."
    },
    {
      "speaker": 2,
      "start": 1657.0,
      "end": 1663.66,
      "text": " I wonder what happens when you teach a model to predict the next image in every YouTube video."
    },
    {
      "speaker": 2,
      "start": 1664.38,
      "end": 1665.3,
      "text": " What capabilities emerge?"
    },
    {
      "speaker": 0,
      "start": 1665.96,
      "end": 1670.02,
      "text": " Yeah, it′s going to be interesting. It should be much better at generating videos. I guess"
    },
    {
      "speaker": 2,
      "start": 1670.02,
      "end": 1674.04,
      "text": " there′s already work on generating videos. I feel like generating videos is kind of like that"
    },
    {
      "speaker": 2,
      "start": 1674.04,
      "end": 1679.62,
      "text": " unicorn story moment. Remember in the early days of GPT-3 when they were trying to show how great"
    },
    {
      "speaker": 2,
      "start": 1679.62,
      "end": 1684.04,
      "text": " it was? They said, look, you can start the first sentence of a story about something that it"
    },
    {
      "speaker": 2,
      "start": 1684.04,
      "end": 1693.64,
      "text": " definitely has never seen. It was something about unicorns. It could just write a story. It′s"
    },
    {
      "speaker": 2,
      "start": 1694.4,
      "end": 1699.74,
      "text": " where you start with an image and you just say, hey, finish this. Make this a one-minute video"
    },
    {
      "speaker": 2,
      "start": 1699.74,
      "end": 1705.52,
      "text": " from this scene. That′ll happen. Just like with GPT-3, the thing that′s going to blow us away"
    },
    {
      "speaker": 2,
      "start": 1705.52,
      "end": 1709.62,
      "text": " are the things we can′t predict it′ll be able to do. It′s going to have capabilities"
    },
    {
      "speaker": 2,
      "start": 1709.62,
      "end": 1710.98,
      "text": " that just emerge."
    },
    {
      "speaker": 0,
      "start": 1711.56,
      "end": 1715.16,
      "text": " Well, I have to admit that I was not at all impressed by the unicorn story. In fact,"
    },
    {
      "speaker": 0,
      "start": 1715.22,
      "end": 1719.7,
      "text": " that′s why I was skeptical. I was like, this is clearly cherry-picked and it′s from a fairy"
    },
    {
      "speaker": 0,
      "start": 1719.7,
      "end": 1721.52,
      "text": " tale and you put anything else in. It′s just not useful."
    },
    {
      "speaker": 0,
      "start": 1721.74,
      "end": 1727.58,
      "text": " Well, when you do NLP, there′s different kinds of tasks. Some tasks are easier to evaluate than"
    },
    {
      "speaker": 0,
      "start": 1727.58,
      "end": 1731.78,
      "text": " others. Like information extraction, did you identify the right that a company is an"
    },
    {
      "speaker": 0,
      "start": 1731.78,
      "end": 1737.34,
      "text": " organization or is it a rock band or whatever? If you are doing search, it′s very hard to know if"
    },
    {
      "speaker": 0,
      "start": 1737.34,
      "end": 1741.26,
      "text": " you have the best ranking in a lot of cases. If you′re doing summarization, there are many"
    },
    {
      "speaker": 0,
      "start": 1741.26,
      "end": 1747.2,
      "text": " legitimate ways to summarize a paper. It′s really hard to evaluate summarization. If you′re"
    },
    {
      "speaker": 0,
      "start": 1747.2,
      "end": 1752.14,
      "text": " generating a story, you can generate almost anything and it′s a story. This is why I was"
    },
    {
      "speaker": 0,
      "start": 1752.14,
      "end": 1756.82,
      "text": " not at all impressed by the unicorn example, but it turned out that actually there was more behind"
    },
    {
      "speaker": 2,
      "start": 1756.82,
      "end": 1761.1,
      "text": " it than the cherry-picked example. Although GPT-3… I wasn′t impressed with GPT-3 myself until the"
    },
    {
      "speaker": 2,
      "start": 1761.1,
      "end": 1764.88,
      "text": " instruct GPT version came out and the thing actually did your bidding."
    },
    {
      "speaker": 0,
      "start": 1765.36,
      "end": 1768.2,
      "text": " Yeah, well, they improved on it. Yeah, they really improved on it."
    },
    {
      "speaker": 0,
      "start": 1768.46,
      "end": 1773.36,
      "text": " The problem is initially they were hyping it in ways that weren′t helpful. I know that now"
    },
    {
      "speaker": 0,
      "start": 1773.36,
      "end": 1778.18,
      "text": " they′re being more careful. I mean, open AI. Or maybe they did have more behind the scene. They"
    },
    {
      "speaker": 0,
      "start": 1778.18,
      "end": 1781.86,
      "text": " kind of said, oh, well, we know stuff that you don′t know and we can′t share it. So you want"
    },
    {
      "speaker": 0,
      "start": 1781.86,
      "end": 1788.14,
      "text": " everyone to be able to test things. That′s what happened with the fake blood testing company and"
    },
    {
      "speaker": 2,
      "start": 1788.14,
      "end": 1792.52,
      "text": " all that. It was clear from the beginning it was fraud. So you have to, if you′re going to make"
    },
    {
      "speaker": 2,
      "start": 1792.52,
      "end": 1797.68,
      "text": " big claims, you need to be able to show your cards. Yep. All right. So zooming out a bit,"
    },
    {
      "speaker": 2,
      "start": 1797.84,
      "end": 1805.36,
      "text": " what do you think is going to be the most exciting things to pay attention to on the research side of"
    },
    {
      "speaker": 2,
      "start": 1805.36,
      "end": 1809.96,
      "text": " your fields? You really have more than one field. But I′d love to just hear your thoughts. What′s"
    },
    {
      "speaker": 2,
      "start": 1809.96,
      "end": 1815.66,
      "text": " in your mind these days given this kind of big sea change as you describe it, which I agree."
    },
    {
      "speaker": 0,
      "start": 1816.3,
      "end": 1818.9,
      "text": " Well, there′s a lot of people doing a lot of stuff. There′s a lot of people really interested"
    },
    {
      "speaker": 0,
      "start": 1818.9,
      "end": 1824.82,
      "text": " in AI safety and AI anti-bias. They′re all very important. I think there′s also a lot of people"
    },
    {
      "speaker": 0,
      "start": 1824.82,
      "end": 1828.1,
      "text": " looking at the AI human interface, which is something I′ve been interested in for a long"
    },
    {
      "speaker": 0,
      "start": 1828.1,
      "end": 1833.24,
      "text": " time. And that′s super important. People doing driving cars, self-driving cars have a bit of a"
    },
    {
      "speaker": 0,
      "start": 1833.24,
      "end": 1838.2,
      "text": " head start, mainly on seeing how hard the problem is. Actually, I had a PhD student at Cecilia"
    },
    {
      "speaker": 0,
      "start": 1838.2,
      "end": 1844.48,
      "text": " Aragon who looked at projecting LIDAR visualizations for helicopter pilots on the screen and how could"
    },
    {
      "speaker": 0,
      "start": 1844.48,
      "end": 1849.3,
      "text": " we make that work and have them not crash? Because this could show them if, say, a squall was ahead"
    },
    {
      "speaker": 0,
      "start": 1849.3,
      "end": 1853.96,
      "text": " and they might potentially crash if they went into it. And we found that the simplest,"
    },
    {
      "speaker": 2,
      "start": 1854.12,
      "end": 1857.04,
      "text": " most bare-bones interface was the very best so that they weren′t distracted."
    },
    {
      "speaker": 2,
      "start": 1857.66,
      "end": 1862.52,
      "text": " So I′ve always had questions about self-driving cars and that problem of the attention of the"
    },
    {
      "speaker": 2,
      "start": 1862.52,
      "end": 1868.54,
      "text": " driver. And that′s really not solved. And the studies I have seen on automatically generated"
    },
    {
      "speaker": 2,
      "start": 1868.54,
      "end": 1873.54,
      "text": " language and interfaces, even some we′ve done in the Scholarify semantic scholar project,"
    },
    {
      "speaker": 2,
      "start": 1873.84,
      "end": 1878.96,
      "text": " semantic reader project, we don′t have good answers for that. People just start to rely"
    },
    {
      "speaker": 2,
      "start": 1878.96,
      "end": 1884.92,
      "text": " on the automatically generated output. It′s natural. And so that′s a huge problem that"
    },
    {
      "speaker": 2,
      "start": 1884.92,
      "end": 1889.7,
      "text": " needs to be solved. What are some of the ways that we could help people if everyone comes to rely on"
    },
    {
      "speaker": 2,
      "start": 1889.7,
      "end": 1895.58,
      "text": " chat GPT for day-to-day work? What are some of the levers we can pull to help them?"
    },
    {
      "speaker": 0,
      "start": 1896.2,
      "end": 1900.82,
      "text": " I haven′t solved this problem. I mean, it′s certainly good user interface design,"
    },
    {
      "speaker": 0,
      "start": 1900.88,
      "end": 1905.48,
      "text": " understanding people. So HCI shows us how to study people and how they work and how they"
    },
    {
      "speaker": 0,
      "start": 1905.48,
      "end": 1911.54,
      "text": " work with technology. So using HCI methods to deeply study that and in different contexts."
    },
    {
      "speaker": 0,
      "start": 1911.68,
      "end": 1915.86,
      "text": " It′s different in a medical setting. There′s a colleague that, Ilifar Salehi here at the"
    },
    {
      "speaker": 0,
      "start": 1915.86,
      "end": 1920.8,
      "text": " iSchool at Berkeley, who is looking at machine translation in a medical setting and when"
    },
    {
      "speaker": 0,
      "start": 1920.8,
      "end": 1926.32,
      "text": " information is not translated correctly and how that can adversely impact marginalized communities"
    },
    {
      "speaker": 0,
      "start": 1926.32,
      "end": 1930.3,
      "text": " when the translation isn′t really the right thing and how to get the context right."
    },
    {
      "speaker": 0,
      "start": 1930.76,
      "end": 1936.56,
      "text": " So I think each setting is probably going to need some specialized research. And furthermore,"
    },
    {
      "speaker": 0,
      "start": 1936.96,
      "end": 1941.14,
      "text": " one of your podcasts is about how do people inject poison, the training data and so on."
    },
    {
      "speaker": 0,
      "start": 1941.26,
      "end": 1944.62,
      "text": " And so you're going to have to be very careful about attacks like that. It′s not a field that"
    },
    {
      "speaker": 0,
      "start": 1944.62,
      "end": 1948.76,
      "text": " I′m in. Perhaps it will be important to have diversification in the different models so that"
    },
    {
      "speaker": 0,
      "start": 1948.76,
      "end": 1953.72,
      "text": " there′s ways to check them, make sure that they are safe and appropriate for a particular use."
    },
    {
      "speaker": 0,
      "start": 1954.04,
      "end": 1959.9,
      "text": " I think the techniques of HCI and ethnography really work independent of the context. It′s"
    },
    {
      "speaker": 0,
      "start": 1959.9,
      "end": 1965.74,
      "text": " not AI. People in AI don′t necessarily want to sit down with people, humans, and see their"
    },
    {
      "speaker": 0,
      "start": 1965.74,
      "end": 1971.2,
      "text": " details and what they do and so on. But that′s the only way to have really working systems that"
    },
    {
      "speaker": 2,
      "start": 1971.2,
      "end": 1976.96,
      "text": " are good for society. Yeah, I′ve noticed that there′s this kind of mindset of people who build"
    },
    {
      "speaker": 2,
      "start": 1976.96,
      "end": 1982.82,
      "text": " AI, generally people who build AI systems. It′s the engineering mindset. The more you can take"
    },
    {
      "speaker": 2,
      "start": 1982.82,
      "end": 1987.72,
      "text": " the person out of the equation, the better because I want my development environment to be nice and"
    },
    {
      "speaker": 2,
      "start": 1987.72,
      "end": 1991.1,
      "text": " clean and straightforward and I want to build something that I understand. And as soon as you"
    },
    {
      "speaker": 2,
      "start": 1991.1,
      "end": 1996.08,
      "text": " get people involved, oof, people are complicated. But what you′re saying is you have to include"
    },
    {
      "speaker": 0,
      "start": 1996.08,
      "end": 2002.08,
      "text": " the person. Yeah, and that′s why I′m heartened by the new interest in NLP plus HCI. There′s"
    },
    {
      "speaker": 0,
      "start": 2002.08,
      "end": 2005.58,
      "text": " been workshops I′ve asked to talk at because I′ve been thinking about it for a long time."
    },
    {
      "speaker": 0,
      "start": 2006.06,
      "end": 2011.04,
      "text": " But it′s true that a lot of people who are making the biggest advances in the NLP AI field are"
    },
    {
      "speaker": 0,
      "start": 2011.04,
      "end": 2015.54,
      "text": " mathematicians or physicists and it′s just not what they think about. They like to think abstract"
    },
    {
      "speaker": 0,
      "start": 2015.54,
      "end": 2020.56,
      "text": " way and they′re brilliant and they′re really improving these systems. But we need teams to"
    },
    {
      "speaker": 0,
      "start": 2020.56,
      "end": 2027.26,
      "text": " work on technology. The one-person band just doesn′t exist in this space. So what would"
    },
    {
      "speaker": 2,
      "start": 2027.26,
      "end": 2033.14,
      "text": " you say to students coming into these fields just now? Has the advice changed at all? It′s hard to"
    },
    {
      "speaker": 0,
      "start": 2033.14,
      "end": 2037.34,
      "text": " know what to say right now. It′s moving so fast. What I say to all students is what are you"
    },
    {
      "speaker": 0,
      "start": 2037.34,
      "end": 2042.22,
      "text": " passionate about? What really interests you? Do that. Don′t do the trendiest thing for its own"
    },
    {
      "speaker": 0,
      "start": 2042.22,
      "end": 2048.04,
      "text": " sake. It′s definitely a big question mark right now for research universities and AI labs and"
    },
    {
      "speaker": 0,
      "start": 2048.04,
      "end": 2053.6,
      "text": " other research groups. If there′s a big microscope that some people have and you don′t, how do you"
    },
    {
      "speaker": 0,
      "start": 2053.6,
      "end": 2059.1,
      "text": " compete? There′s open source effort, things that Hugging Face and others are doing. I think the"
    },
    {
      "speaker": 0,
      "start": 2059.1,
      "end": 2062.44,
      "text": " US government is interested as well in giving everybody a microscope,"
    },
    {
      "speaker": 0,
      "start": 2062.88,
      "end": 2067.36,
      "text": " meaning these large language models and the ability to run them. I think that people are"
    },
    {
      "speaker": 0,
      "start": 2067.36,
      "end": 2072.52,
      "text": " very aware of that issue. But then if you want to do advanced research on this, you get brilliant"
    },
    {
      "speaker": 0,
      "start": 2072.52,
      "end": 2077.6,
      "text": " people like Agent Choi at University of Washington and AI2 that are showing that you can do a lot"
    },
    {
      "speaker": 0,
      "start": 2077.6,
      "end": 2082.38,
      "text": " with much less. You don′t need to have all these parameters and so on. That′s where the university"
    },
    {
      "speaker": 0,
      "start": 2082.38,
      "end": 2086.2,
      "text": " can help. The university people are also going to be looking at how do you save energy. Well,"
    },
    {
      "speaker": 0,
      "start": 2086.32,
      "end": 2090.54,
      "text": " I mean, so is industry. But how do you save energy when you use these? It′s very wasteful right now."
    },
    {
      "speaker": 0,
      "start": 2090.78,
      "end": 2095.1,
      "text": " These are all great areas for research. Of course, understanding what these models are doing,"
    },
    {
      "speaker": 0,
      "start": 2095.3,
      "end": 2099.42,
      "text": " understanding the mind better, can they help us understand the mind in some way? I′m sure"
    },
    {
      "speaker": 0,
      "start": 2099.42,
      "end": 2103.84,
      "text": " psychologists are thinking about that. There′s work already, I′ve seen work in linguistics on"
    },
    {
      "speaker": 0,
      "start": 2103.84,
      "end": 2109.84,
      "text": " say using GANs and adversarial methods to model linguistics in other species."
    },
    {
      "speaker": 0,
      "start": 2110.52,
      "end": 2115.62,
      "text": " There′s always more research questions. If you′re interested in being in industry and business,"
    },
    {
      "speaker": 0,
      "start": 2115.74,
      "end": 2119.7,
      "text": " then go do that. If you′re interested in research, then find a problem that just really"
    },
    {
      "speaker": 0,
      "start": 2119.7,
      "end": 2122.0,
      "text": " interests you because that′s how you can finish your PhD."
    },
    {
      "speaker": 2,
      "start": 2122.56,
      "end": 2127.64,
      "text": " And just to bring it to a close, what′s coming up in your life that listeners might be"
    },
    {
      "speaker": 2,
      "start": 2127.64,
      "end": 2132.16,
      "text": " interested to know about? Is there a project or an event on the horizon?"
    },
    {
      "speaker": 0,
      "start": 2132.56,
      "end": 2136.24,
      "text": " Well, I think the project that I′m most excited about is working with my PhD student,"
    },
    {
      "speaker": 0,
      "start": 2136.34,
      "end": 2141.08,
      "text": " Chase Stokes, on understanding this interaction between language and visualization. We just"
    },
    {
      "speaker": 0,
      "start": 2141.08,
      "end": 2147.94,
      "text": " finished a paper that we submitted on if you place text on a chart and the goal of the chart is to"
    },
    {
      "speaker": 0,
      "start": 2149.38,
      "end": 2153.1,
      "text": " predict how text impacts that prediction. Like who′s going to win an election by looking at"
    },
    {
      "speaker": 0,
      "start": 2153.1,
      "end": 2157.52,
      "text": " this chart? And we actually found surprisingly that the text did not influence the prediction"
    },
    {
      "speaker": 0,
      "start": 2157.52,
      "end": 2162.88,
      "text": " all that much. In this case, where people relied more on the visual input. But in another study we"
    },
    {
      "speaker": 0,
      "start": 2162.88,
      "end": 2168.04,
      "text": " did where it was more what are you taking away information-wise, then the way the text was used"
    },
    {
      "speaker": 0,
      "start": 2168.04,
      "end": 2173.0,
      "text": " did have an influence. So what we really need to do is understand this interplay more. I′m just"
    },
    {
      "speaker": 0,
      "start": 2173.0,
      "end": 2176.78,
      "text": " very excited about that topic. I know it′s kind of a niche topic, but it′s what interests me."
    },
    {
      "speaker": 2,
      "start": 2176.8,
      "end": 2183.5,
      "text": " Oh, far from niche. We′re going into a very momentous political year and these little"
    },
    {
      "speaker": 2,
      "start": 2183.5,
      "end": 2188.94,
      "text": " interactions between a person and a piece of information can have massive, massive effects."
    },
    {
      "speaker": 2,
      "start": 2189.28,
      "end": 2191.6,
      "text": " You′re right. We don′t really understand how they work, do we?"
    },
    {
      "speaker": 0,
      "start": 2192.0,
      "end": 2195.68,
      "text": " No. I like to work in topics where there isn′t a lot of work at that time,"
    },
    {
      "speaker": 0,
      "start": 2195.94,
      "end": 2199.86,
      "text": " like search interfaces and so on. And then when it becomes popular, I tend to move on. I think"
    },
    {
      "speaker": 0,
      "start": 2199.86,
      "end": 2203.78,
      "text": " I can′t compete or something. So I have to find a new thing that nobody′s thinking about."
    },
    {
      "speaker": 2,
      "start": 2203.78,
      "end": 2206.88,
      "text": " Uh-oh. I might have just ruined your picnic. Now everyone′s going to get interested in"
    },
    {
      "speaker": 2,
      "start": 2206.88,
      "end": 2208.16,
      "text": " language and visualization."
    },
    {
      "speaker": 0,
      "start": 2208.54,
      "end": 2212.44,
      "text": " No, no. I want that. In fact, the keynote I gave, I think, helped with that. So I want"
    },
    {
      "speaker": 0,
      "start": 2212.44,
      "end": 2213.48,
      "text": " people to be working on this."
    },
    {
      "speaker": 2,
      "start": 2213.88,
      "end": 2215.74,
      "text": " Marty, thanks so much for talking with us."
    },
    {
      "speaker": 0,
      "start": 2216.06,
      "end": 2217.52,
      "text": " It was a pleasure. It was really fun."
    },
    {
      "speaker": 1,
      "start": 2220.08,
      "end": 2225.8,
      "text": " All right, everyone. That′s our show for today. To learn more about today′s guest or the topics"
    },
    {
      "speaker": 1,
      "start": 2225.8,
      "end": 2231.6,
      "text": " mentioned in this interview, visit twimmelai.com. Of course, if you like what you hear on the"
    },
    {
      "speaker": 1,
      "start": 2231.6,
      "end": 2236.58,
      "text": " podcast, please subscribe, rate, and review the show on your favorite podcatcher."
    },
    {
      "speaker": 1,
      "start": 2237.14,
      "end": 2240.1,
      "text": " Thanks so much for listening, and catch you next time."
    }
  ],
  "speakers": [
    "SPEAKER_02",
    "SPEAKER_01",
    "SPEAKER_00"
  ]
}